load_test_tsung/LOAD-TEST.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<!--<!DOCTYPE tsung SYSTEM "/Users/goris/Desktop/tsung-1.0.dtd">-->



<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="ec2-52-26-44-52.us-west-2.compute.amazonaws.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
<!--
        <arrivalphase phase="4" duration="30" unit="second">
     <users arrivalrate="8" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="5" duration="30" unit="second">
     <users arrivalrate="16" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="6" duration="30" unit="second">
     <users arrivalrate="32" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="7" duration="30" unit="second">
     <users arrivalrate="64" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="8" duration="30" unit="second">
     <users arrivalrate="128" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="9" duration="30" unit="second">
     <users arrivalrate="256" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="10" duration="30" unit="second">
     <users arrivalrate="512" unit="second"></users>
   </arrivalphase>
-->
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="Restaurant-Management" probability="30" type="ts_http">

      <!-- start out at the dashboard. -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is looking at posts -->
      <thinktime value="2" random="true"></thinktime>



      <!-- visit the Restaurants page  -->
      <request>
        <http url='/restaurants' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is filling out new restaurant form -->
      <thinktime value="2" random="true"></thinktime>






      <!-- visit the New restaurant form, as a user would do.  -->
      <request>
        <http url='/restaurants/new' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is filling out new restaurant form -->
      <thinktime value="2" random="true"></thinktime>

      <!-- create a random number to make a unique restaurant name -->
      <setdynvars sourcetype="random_number" start="1000" end="9999999">
        <var name="random_restaurant_name" />
      </setdynvars>

    
      <request subst="true">
        <dyn_variable name="created_restaurant_url" re="[Ll]ocation: (http://.*)\r"/>
        <dyn_variable name="created_restaurant_id" re="[Ll]ocation: http://.*/restaurants/(.*)\r"/>
        <http
          url='/restaurants'
          version='1.1'
          method='POST'
          contents='restaurant%5Bname%5D=Restaurant_%%_random_restaurant_name%%&amp;
          restaurant%5Bimage%5D=%%readafile:restaurant.jpg&amp;
          commit=Create+Restaurant'>
        </http>
      </request>

      <!-- visit the new menus form, as a user would do.  -->
      <request>
        <http url='/menus/new' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, user is fillinf in new menu form -->
      <thinktime value="2" random="true"></thinktime>

      <!-- create a new menu in the restaurant we just created -->
      <setdynvars sourcetype="random_number" start="1000" end="9999999">
        <var name="random_menu_name" />
      </setdynvars>

      <request subst="true">
        <dyn_variable name="created_menu_url" re="[Ll]ocation: (http://.*)\r"/>
        <dyn_variable name="created_menu_id" re="[Ll]ocation: http://.*/menus/(.*)\r"/>
        <http
          url='/menus'
          version='1.1'
          method='POST'
          contents='menu%5Btitle%5D=menu_%%_random_menu_name%%&amp;menu%5Bdescription%5D=some_desc_%%_random_menu_name%%&amp;menu%5Brestaurant_id%5D=%%_created_restaurant_id%%&amp;commit=Create+Menu'>
          <http_header name="Accept" value="application/json"/>
        </http>
      </request>

      <!-- wait for up to 2 seconds, user decides to delete submission -->
      <thinktime value="2" random="true"></thinktime>





      <!-- create a new menu in the restaurant we just created -->
      <setdynvars sourcetype="random_number" start="1000" end="9999999">
        <var name="random_item_name" />
      </setdynvars>

      <request subst="true">
        <dyn_variable name="created_item_url" re="[Ll]ocation: (http://.*)\r"/>
        <dyn_variable name="created_item_id" re="[Ll]ocation: http://.*/items/(.*)\r"/>
        <http
          url='/items'
          version='1.1'
          method='POST'
          contents='item%5Btitle%5D=item_%%_random_item_name%%&amp;item%5Bdescription%5D=some_desc_%%_random_item_name%%&amp;
          item%5Bmenu_id%5D=%%_created_menu_id%%&amp;
          item%5Bprice%5D=9&amp;
          commit=Create+Item'>
          <http_header name="Accept" value="application/json"/>
        </http>
      </request>

      <!-- wait for up to 2 seconds, user decides to delete submission -->
      <thinktime value="2" random="true"></thinktime>





       <!-- delete the menu we just created -->
      <request subst="true">
        <http url="%%_created_item_url%%" method="DELETE">
        </http>
      </request>

      <thinktime value="2" random="true"></thinktime>

       <!-- delete the menu we just created -->
      <request subst="true">
        <http url="%%_created_menu_url%%" method="DELETE">
        </http>
      </request>

      <thinktime value="2" random="true"></thinktime>

      <!-- delete the restaurant we just created -->
      <request subst="true">
        <http url="%%_created_restaurant_url%%" method="DELETE">
        </http>
      </request>

      <!-- wait for up to 2 seconds, user decides to delete community -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Uncomment the following to debug print your dynamic variables  --> 
      <!--
                 <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
        io:format([126, $p, 126, $n, 126, $n], [DynVars]),
        ok end.">
        <var name="dump" />
      </setdynvars>
      -->

    
  </session>
    <session name="Restaurant-Customer" probability="70" type="ts_http">

     <!-- visit the restaurant, as a customer would do.  -->
      <request>
        <http url='/restaurants/1?table_id=1' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds, browsing the menu -->
      <thinktime value="2" random="true"></thinktime>
      <!-- add item 1 into tab-->
      <request>
        <dyn_variable name="created_line_item1_url" re="[Ll]ocation: (http://.*)\r"/>
        <dyn_variable name="created_line_item1_id" jsonpath="$.id"/>
        <dyn_variable name="cart_id" jsonpath="$.cart_id"/>
        <http url='/line_items?item_id=1' version='1.1' method='POST'>
        <http_header name="Accept" value="application/json"/>
  </http>
      </request>

      <!-- wait for up to 2 seconds, browsing the menu -->
      <thinktime value="2" random="true"></thinktime>
      <!-- add item 2 to cart -->

     <request>
        <http url='/carts/add_to_order?id=%%_cart_id%%' version='1.1' method='POST'></http>
      </request>

      <!-- wait for up to 2 seconds, browsing the menu -->
  
   <thinktime value="2" random="true"></thinktime>

      <request subst="true">
        <http url="%%_created_line_item1_url%%" method="DELETE">
        </http>
      </request>
      <!-- wait for up to 2 seconds, user decides to delete community -->
      <thinktime value="2" random="true"></thinktime>
      


                 <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
        io:format([126, $p, 126, $n, 126, $n], [DynVars]),
        ok end.">
        <var name="dump" />
      </setdynvars>
      
    </session>
  </sessions>
</tsung>