load_test_tsung/test2no_error.xml
<?xml version="1.0"?>

<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">

<tsung loglevel="notice" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="ec2-52-24-78-175.us-west-2.compute.amazonaws.com" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="Owner sign up" type="ts_http" probability="10">



      <setdynvars sourcetype="random_number" start="1000" end="9999999">
        <var name="random_owner_name"/>
      </setdynvars>
      <request>
         <http url="/owners" version="1.1" method="POST" contents="owner%5Bemail%5D=Owner_%%_random_owner_name%%&amp;           owner%5Bpassword%5D=12345678&amp;           owner%5Bpassword-confirmation%5D=12345678&amp;           commit=Sign+Up">
        </http>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/owners/sign_out" version="1.1" method="DELETE"/>
      </request>

      <thinktime value="2" random="true"/>
    </session>
 
    <session name="User sign up" type="ts_http" probability="10">



      <setdynvars sourcetype="random_number" start="1000" end="9999999">
        <var name="random_user_name"/>
      </setdynvars>
      <request>
         <http url="/users" version="1.1" method="POST" contents="user%5Bemail%5D=User_%%_random_user_name%%&amp;user%5Bpassword%5D=12345678&amp;           user%5Bpassword-confirmation%5D=12345678&amp;           commit=Sign+Up">
        </http>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http url="/users/sign_out" version="1.1" method="DELETE"/>
      </request>

      <thinktime value="2" random="true"/>
    </session>



<session name="Restaurant-Management" probability="80" type="ts_http">

      

	<request subst="true">
        <http url="/owners/sign_in" version="1.1" method="POST" contents="owner%5Bemail%5D=o1@seed.com&amp;            owner%5Bpassword%5D=12345678&amp;           commit=Sign In">
        </http>
      </request>


      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>


      <thinktime value="2" random="true"/>

      <request>
        <http url="/restaurants" version="1.1" method="GET"/>
      </request>


      <thinktime value="2" random="true"/>

      <request>
        <http url="/restaurants/new" version="1.1" method="GET"/>
      </request>


      <thinktime value="2" random="true"/>

      <setdynvars sourcetype="random_number" start="1000" end="9999999">
        <var name="random_restaurant_name"/>
      </setdynvars>

    
      <request subst="true">
        <dyn_variable name="created_restaurant_url" re="[Ll]ocation: (http://.*)\r"/>
        <dyn_variable name="created_restaurant_id" re="[Ll]ocation: http://.*/restaurants/(.*)\r"/>
        <http url="/restaurants" version="1.1" method="POST" contents="restaurant%5Bname%5D=Restaurant_%%_random_restaurant_name%%&amp;           restaurant%5Bimage%5D=%%readafile:restaurant.jpg&amp;           commit=Create+Restaurant">
        </http>
      </request>


      <request>
        <http url="/menus/new" version="1.1" method="GET"/>
      </request>

      <thinktime value="2" random="true"/>

      <setdynvars sourcetype="random_number" start="1000" end="9999999">
        <var name="random_menu_name"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="created_menu_url" re="[Ll]ocation: (http://.*)\r"/>
        <dyn_variable name="created_menu_id" re="[Ll]ocation: http://.*/menus/(.*)\r"/>
	<dyn_variable name="created_menu_id_header" re="[cC]reatedid: (.*)\r"/>
        <http url="/menus" version="1.1" method="POST" contents="menu%5Btitle%5D=menu_%%_random_menu_name%%&amp;menu%5Bdescription%5D=some_desc_%%_random_menu_name%%&amp;menu%5Brestaurant_id%5D=%%_created_restaurant_id%%&amp;commit=Create+Menu">
<!--          <http_header name="Accept" value="application/json"/> -->
        </http>
      </request>
      
      <!--    <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
        io:format([126, $p, 126, $n, 126, $n], [DynVars]),
        ok end.">
        <var name="dump" />
      </setdynvars>
-->

      <thinktime value="2" random="true"/>


      <setdynvars sourcetype="random_number" start="1000" end="9999999">
        <var name="random_item_name"/>
      </setdynvars>

      <request subst="true">
        <dyn_variable name="created_item_url" re="[Ll]ocation: (http://.*)\r"/>
        <dyn_variable name="created_item_id" re="[Ll]ocation: http://.*/items/(.*)\r"/>
        <http url="/items" version="1.1" method="POST" contents="item%5Btitle%5D=item_%%_random_item_name%%&amp;item%5Bdescription%5D=some_desc_%%_random_item_name%%&amp;           item%5Bmenu_id%5D=%%_created_menu_id_header%%&amp;           item%5Bprice%5D=9&amp;           commit=Create+Item">
<!--          <http_header name="Accept" value="application/json"/> -->
        </http>
      </request>

<setdynvars sourcetype="random_number" start="1000" end="9999999">
        <var name="random_table_name" />
      </setdynvars>

<request subst="true">
        <dyn_variable name="created_table_url" re="[Ll]ocation: (http://.*)\r"/>
        <dyn_variable name="created_table_id" re="[Ll]ocation: http://.*/tables/(.*)\r"/>
        <http
          url='/tables'
          version='1.1'
          method='POST'
          contents='table%5Bname%5D=table_%%_random_table_name%%&amp;table%5Brestaurant_id%5D=%%_created_restaurant_id%%&amp;
          commit=Create+Table'>
        </http>
      </request>

	<thinktime value="2" random="true"></thinktime>
<!--
      <request subst="true">
        <http url="%%_created_table_url%%" method="DELETE">
        </http>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="%%_created_item_url%%" method="DELETE">
        </http>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="%%_created_menu_url%%" method="DELETE">
        </http>
      </request>
-->
      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="%%_created_restaurant_url%%" method="DELETE">
        </http>
      </request>

      <thinktime value="2" random="true"/>

<thinktime value="2" random="true"/>


      </session>


  </sessions>
</tsung>